apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_wdt.c
/****************************************************************************
 * arch/xtensa/src/esp32s2/esp32s2_wdt.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <stdbool.h>
#include <assert.h>
#include <nuttx/debug.h>

#include "xtensa.h"
#include "espressif/esp_irq.h"
#include "esp32s2_rtc_gpio.h"
#include "soc/efuse_reg.h"
#include "soc/rtc_cntl_reg.h"
#include "hal/rwdt_ll.h"
#include "hardware/esp32s2_tim.h"

#include "esp32s2_wdt.h"
#include "soc/rtc.h"
#include "soc/periph_defs.h"
#include "esp_private/periph_ctrl.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Offset relative to each watchdog timer instance memory base */

#define RWDT_CONFIG0_OFFSET         0x0094
#define XTWDT_CONFIG0_OFFSET        0x0060

/* RWDT */

#define RWDT_STAGE0_TIMEOUT_OFFSET  0x0098
#define RWDT_STAGE1_TIMEOUT_OFFSET  0x009c
#define RWDT_STAGE2_TIMEOUT_OFFSET  0x00a0
#define RWDT_STAGE3_TIMEOUT_OFFSET  0x00a4
#define RWDT_FEED_OFFSET            0x00a8
#define RWDT_WP_REG                 0x00ac
#define RWDT_INT_ENA_REG_OFFSET     0x0040
#define RWDT_INT_CLR_REG_OFFSET     0x004c

/* XTWDT */

#define XTWDT_TIMEOUT_OFFSET        0x00f4
#define XTWDT_CLK_PRESCALE_OFFSET   0x00f0
#define XTWDT_INT_ENA_REG_OFFSET    0x0040

/* Number of cycles for RTC_SLOW_CLK calibration */

#define SLOW_CLK_CAL_CYCLES 1024

#define N 19
#define Q_TO_FLOAT(x) ((float)x/(float)(1<<N))

/* Check whether the provided device is a RTC Watchdog Timer */

#define IS_RWDT(dev)    (((struct esp32s2_wdt_priv_s *)dev)->type == RTC)

/* Check whether the provided device is a Main Watchdog Timer */

#define IS_MWDT(dev)    (((struct esp32s2_wdt_priv_s *)dev)->type == TIMER)

/* Check whether the provided device is a XTAL32K Watchdog Timer */

#define IS_XTWDT(dev)    (((struct esp32s2_wdt_priv_s *)dev)->type == XTAL32K)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* ESP32-S2 WDT private data */

struct esp32s2_wdt_priv_s
{
  struct esp32s2_wdt_ops_s *ops;
  uint32_t                  base;    /* WDT register base address */
  uint8_t                   periph;  /* Peripheral ID */
  uint8_t                   irq;     /* Interrupt ID */
  int32_t                   cpuint;  /* CPU interrupt assigned to this WDT */
  bool                      inuse;   /* Flag indicating if this WDT is in use */
  enum wdt_peripheral_e     type;    /* Type of the WDT Peripheral */
};

/****************************************************************************
 * External Functions
 ****************************************************************************/

extern void esp_rom_delay_us(uint32_t us);

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* WDT registers access *****************************************************/

static void wdt_putreg(struct esp32s2_wdt_dev_s *dev, uint32_t offset,
                       uint32_t value);
static void wdt_modifyreg32(struct esp32s2_wdt_dev_s *dev, uint32_t offset,
                            uint32_t clearbits, uint32_t setbits);
static uint32_t wdt_getreg(struct esp32s2_wdt_dev_s *dev, uint32_t offset);

/* WDT operations ***********************************************************/

static void wdt_start(struct esp32s2_wdt_dev_s *dev);
static void wdt_stop(struct esp32s2_wdt_dev_s *dev);
static void wdt_enablewp(struct esp32s2_wdt_dev_s *dev);
static void wdt_disablewp(struct esp32s2_wdt_dev_s *dev);
static void wdt_pre(struct esp32s2_wdt_dev_s *dev,
                    uint16_t value);
static int32_t wdt_settimeout(struct esp32s2_wdt_dev_s *dev,
                              uint32_t value,
                              enum esp32s2_wdt_stage_e stage);
static void wdt_feed(struct esp32s2_wdt_dev_s *dev);
static int32_t wdt_config_stage(struct esp32s2_wdt_dev_s *dev,
                                enum esp32s2_wdt_stage_e stage,
                                enum esp32s2_wdt_stage_action_e cfg);
static int32_t wdt_setisr(struct esp32s2_wdt_dev_s *dev,
                          xcpt_t handler, void *arg);
static void wdt_enableint(struct esp32s2_wdt_dev_s *dev);
static void wdt_disableint(struct esp32s2_wdt_dev_s *dev);
static void wdt_ackint(struct esp32s2_wdt_dev_s *dev);
static uint16_t wdt_rtc_clk(struct esp32s2_wdt_dev_s *dev);
static void wdt_rstclk(struct esp32s2_wdt_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ESP32-S2 WDT ops */

struct esp32s2_wdt_ops_s esp32s2_wdt_ops =
{
  .start         = wdt_start,
  .stop          = wdt_stop,
  .enablewp      = wdt_enablewp,
  .disablewp     = wdt_disablewp,
  .pre           = wdt_pre,
  .settimeout    = wdt_settimeout,
  .feed          = wdt_feed,
  .stg_conf      = wdt_config_stage,
  .rtc_clk       = wdt_rtc_clk,
  .setisr        = wdt_setisr,
  .enableint     = wdt_enableint,
  .disableint    = wdt_disableint,
  .ackint        = wdt_ackint,
  .rstclk        = wdt_rstclk,
};

